#!/usr/bin/python
# -*- coding: utf-8 -*-

"""
Find potential risk in the announcement pdf file
@author: Kai Wu & Xiwen Zhang
@time: 2018-02-09 16:50
"""

import re

# 不用先分类
RiskDict = {
        '业绩风险':{
            'type':[re.compile('业绩|关闭')],
            'title':[re.compile('业绩.*(下滑|亏损|预亏|转亏|下降|预警)'),
                    re.compile('盈利.*(下降|下滑|减少)'),
                    re.compile('(重大|巨额|大幅|大额)亏损|预计亏损|预亏|转亏|下调|下挫|降低'),
                    re.compile('(?!暂缓)关闭.*(分支机构|子公司|减少新.*投入)'),
                    ],
            'abstract':[],
                },        
    
        '非标准审计意见':{
            'type':[re.compile('出具.*意见|意见.*审计|审计.*意见')],
            'title':[re.compile('非标准.*意见|非标.*意见|带强调事项|出具保留|否定意见|无法表示'),
                     re.compile('非标准.*意见|非标.*意见|带强调事项|出具保留|否定意见|无法表示')],
            'abstract':[],
                },

        '财报更正':{
            'type':[re.compile('(年度|半年度|季度)报告|年报|季报|半年报')
                    ],
            'title':[re.compile('((年度|半年度|季度)报告|年报|季报|半年报).*(更正|修订)'),
                     re.compile('(更正|修订)((年度|半年度|季度)报告|年报|季报|半年报)')
                     ],
	        'del_title':[re.compile('披露时间'),
			           re.compile('说明会')
		               ],
            'abstract':[],
            },
        
        '变更会计师事务所':{
            'type':[re.compile('(会计|会计师)事务所'),
                    ],
            'title':[re.compile('(变|更|改).*(会计|会计师)事务所'),
                     re.compile('(会计|会计师)事务所(变|更|改)')
                     ],
            'abstract':[]
            },
        
        '延期披露':{
            'type':[re.compile('变更.*披露|(延期|延迟).*披露|(无法|不(能)?|未|未(能)?|暂不)披露')
                    ],
            'title':[re.compile('变更.*披露.*(报告|年报|半年报|季报).*(日期|时间|([0-9]{3}[1-9]|[0-9]{2}[1-9][0-9]{1}|[0-9]{1}[1-9][0-9]{2}|[1-9][0-9]{3})年|(((0[13578]|1[02])月(0[1-9]|[12][0-9]|3[01]))|((0[469]|11)月(0[1-9]|[12][0-9]|30))|(02月(0[1-9]|[1][0-9]|2[0-8]))))'),
                     re.compile('(无法|不能|未|未能|暂不)(按时|如期|按期|在.*(时间|期限|([0-9]{3}[1-9]|[0-9]{2}[1-9][0-9]{1}|[0-9]{1}[1-9][0-9]{2}|[1-9][0-9]{3})年|(((0[13578]|1[02])月(0[1-9]|[12][0-9]|3[01]))|((0[469]|11)月(0[1-9]|[12][0-9]|30))|(02月(0[1-9]|[1][0-9]|2[0-8])))))'),
                     re.compile('变更.*(报告|年报|半年报|季报).*披露.*(日期|时间|([0-9]{3}[1-9]|[0-9]{2}[1-9][0-9]{1}|[0-9]{1}[1-9][0-9]{2}|[1-9][0-9]{3})年|(((0[13578]|1[02])月(0[1-9]|[12][0-9]|3[01]))|((0[469]|11)月(0[1-9]|[12][0-9]|30))|(02月(0[1-9]|[1][0-9]|2[0-8]))))'),
                    re.compile('(报告|年报|半年报|季报).*(延期|延迟)披露|(延期|延迟)披露.*(报告|年报|半年报|季报)|(报告|年报|半年报|季报).*(无法|不能|未|未能|暂不)(按时|如期|按期|在.*(时间|期限|(无法|不能|未|未能|暂不)(按时|如期|按期|在.*(时间|期限|([0-9]{3}[1-9]|[0-9]{2}[1-9][0-9]{1}|[0-9]{1}[1-9][0-9]{2}|[1-9][0-9]{3})年|(((0[13578]|1[02])月(0[1-9]|[12][0-9]|3[01]))|((0[469]|11)-(0[1-9]|[12][0-9]|30))|(02-(0[1-9]|[1][0-9]|2[0-8]))))))内?)?披露')
                    ],
            'abstract':[],
            'del_title':[re.compile('交易细节未披露')],
                },
        
        '财务造假':{
            'type':[re.compile('财务造假')
                    ],
            'title':[re.compile('财务.*造假')
                    ],
            'abstract':[],
            },
        
        '涉及诉讼':{
            'type':[re.compile('诉'),
                    re.compile('裁定书'),
                    ],
            'title':[re.compile('诉讼|涉诉|(被)?起诉|收到.*(起诉|上诉)|应诉'),
                     re.compile('裁定书'),
                     re.compile('赔偿')
                    ],
            'abstract':[],
            },
        
#        '做市商退出':{
#            'type':[re.compile('退出.*做市|做市.*退出|不足两家')
#                    ],
#            'title':[re.compile('退出.*做市|做市.*退出|不足两家')
#                    ],
#            'abstract':[],
#            },
#        
#        '变更主办券商':{
#            'type':[re.compile('(变|更).*主办券商|主办券商.*(变|更)')
#                    ],
#            'title':[re.compile('(变|更).*主办券商|主办券商.*(变|更)')
#                    ],
#            'abstract':[],
#            },
#        
 
        '违法违规':{
            'type':[re.compile('处罚|处分'),
                    re.compile('违规|违纪|违法|监管|违反'),
                    re.compile('立案|调查'),
                    re.compile('责令|整顿')
                    ],
            'title':[re.compile('处罚|处分'),
                    re.compile('违规|违纪|违法|监管'),
                    re.compile('立案|收到.*调查|证监会.*调查|证券监督管理.*调查'),
                    re.compile('责令'),
                    re.compile('严格按.*执行'),
                    re.compile('严防'),
                    re.compile('涉嫌|遭'),
                     ],
            'del_title':[re.compile('办法|制度|是否存在|不存在|不属于|承诺|无违法|无违规'),
                         re.compile('(享有|获得)监管授权')
                        ],
            'abstract':[],
            },          

        '董监高离职':{
            'type':[re.compile('(董事|董秘|秘书|监事|高级管理人员|高管|经理|总裁|总监|首席|财务|董监高|总会计师|证券事务代表).*变动'),
                    re.compile('（?!前）(董事|董秘|秘书|监事|高级管理人员|高管|经理|总裁|总监|首席|财务|董监高|总会计师|证券事务代表).*(去世|逝世|病逝|逝世|离职|离任|辞职|卸任)'),
                    re.compile('(辞去|辞任|卸任).*(董事|董秘|秘书|监事|高级管理人员|高管|经理|总裁|总监|首席|财务|董监高|总会计师|证券事务代表)')
                    ],
            'title':[re.compile('（?!前）(董事|董秘|秘书|监事|高级管理人员|高管|经理|总裁|总监|首席|财务|董监高|总会计师|证券事务代表).*(去世|逝世|病逝|逝世|离职|离任|辞职|卸任)'),
                     re.compile('(辞去|辞任|卸任).*(董事|董秘|秘书|监事|高级管理人员|高管|经理|总裁|总监|首席|财务|董监高|总会计师|证券事务代表)'),
                     re.compile('不再担任'),
                     re.compile('提出(离职|离任|辞职|卸任|辞去|辞任)'),
                     re.compile('免去.*职务')
                     ],
            'abstract':[],
            },
        
        '控制权变动': {
            'type':[re.compile('(实际控制人|实控人|控股股东|第一大股东|控制权).*(变|更(?!正))|取得.*控制权'),
                    re.compile('一致行动人.*解除|解除.*一致行动人协议|一致行动人.*到期')
                    ],
            'title':[re.compile('(实际控制人|实控人|控股股东|第一大股东|控制权).*(变|更(?!正))'),
                     re.compile('一致行动人.*解除|解除.*一致行动人协议|一致行动人.*到期'),
                     re.compile('(取得|转让).*本公司.*控制权'),
                     re.compile('成为.*本公司.*(实际控制人|实控人)')
                     ],
	        'del_title':[re.compile('解除限售|质押|名称|更名|工商登记|变更承诺|承诺变更|承诺期限:|工商变更')],
            'abstract':[],
            },
        
        '资金占用':{
            'type':[re.compile('资金.*占用|占用.*资金|占款')
                    ],
            'title':[re.compile('资金.*占用|占用.*资金|占款')
                    ],
            'del_title':[re.compile('专项制度|管理办法|管理制度'),
                         re.compile('外汇占款')
                         ],
            'abstract':[],
            },
                
        '变更募集资金投向':{
            'type':[re.compile('(变|更|改).*募集资金.*(使用|用途|投向)|募集资金.*(使用|用途|投向).*(变|更|改)')
                    ],
            'title':[re.compile('(变|更|改).*募集资金.*(使用|用途|投向)|募集资金.*(使用|用途|投向).*(变|更|改)')
                    ],
	    'del_title':[re.compile('办法|制度')],
            'abstract':[],
            },
        
        '募集资金违规使用':{
            'type':[re.compile('(违规|提前).*募集资金|募集资金.*(违规|提前)')
                    ],
            'title':[re.compile('(违规|提前).*募集资金|募集资金.*(违规|提前)')
                    ],
            'del_title':[re.compile('关于本次.*是否')],
            'abstract':[],
            },
         
        '解除限售':{
            'type':[re.compile('限售|上市流通')],
            'title':[re.compile('解除.*限售|限售.*解除|(限售股|有限售条件|非公开发行).*(流通|上市)')],
            'abstract':[],
            },
     
        '股权质押':{
            'type':[re.compile('((股权|股票|股份|股东).*质押|质押.*(股权|股票|股份|股东))')],
            'title':[
                    re.compile('^((?!解除).)*((股权|股票|股份)质押|质押(股权|股票|股份))((?!解除).)*$'),
                    re.compile('被质押(?!权|人|方)'),
                    re.compile('(再|继续)质押'),
                     ],
            'abstract':[],
            },
                
        '对外担保':{
            'type':[re.compile('(为|对|向).*担保'),
                    ],
            'title':[
                    re.compile('对外.*担保'),
                    re.compile('(为|对)(?!公司)((?!向银行).)*(?<!由关联方)(提供)?担保'),
                    re.compile('(?<!为公司)向(?!银行|金融机构).*(?<!由关联方)提供担保'),
                    re.compile('为(全资|参股)?(子公司|控股公司|控股子公司|孙公司).*提供担保')
                    #'exclude':[re.compile('为.*子公司.*担保')]  
                     ],
            'del_title':[re.compile('办法|制度'),
                         re.compile('(股东|实际控制人|关联方|子公司|控股公司|参股公司)为')
                         ],
            'abstract':[],              
            },
        
        '冻结':{
            'type':[re.compile('冻结')],
            'title':[re.compile('^((?!解除).)*冻结((?!解除).)*$'),
                     re.compile('再次?冻结')
                     ],
            'abstract':[],            
            },
        
        '信息披露不及时':{
            'type':[re.compile('补发|追认'),
                    re.compile('(未(能)?及时.*披露)|信息披露不及时'),
                    ],
            'title':[
                    re.compile('补发|追认'),
                    re.compile('(未(能)?及时.*披露)|信息披露不及时'),
                    ],
            'abstract':[],
            },
        
        '治理失范':{
            'type':[re.compile('公司治理不规范|不符合.*公司治理要求'),        
                    re.compile('及时履行审议程序')
                    ],
            'title':[re.compile('公司治理不规范|不符合.*公司治理要求'),        
                     re.compile('(未(能)?|没(有)?)及时履行审议程序')
                    ],
            'abstract':[],
            },
        
        '重大资产重组':{
            'type':[re.compile('重组'),
                    re.compile('并购|兼并'),
                    re.compile('重大资产重组'),
                    ],
#是否加重组并购相关关键词？
            'title':[re.compile('重组'),
                      re.compile('并购|兼并'),
                     re.compile('重大资产重组'),
                    ],
            'del_title':[re.compile('流通|限售'),
                         re.compile('药物.*重组')
                         ],
            'abstract':[],
        }, 
        
        '暂停上市':{
            'type':[re.compile('上市'),
                    ],
            'title':[re.compile('暂停.*上市'),
                    ],
            'abstract':[], 
            'del_title':[re.compile('恢复上市')
                         ],
            },        

        '终止上市':{
            'type':[re.compile('上市|退市'),
                    ],
            'title':[re.compile('终止.*上市|退市整理'),
                    ],
            'del_title':[re.compile('权证')],
            'abstract':[],            
            },

        '退市警示':{
            'type':[re.compile('退市'),
                    ],
            'title':[re.compile('退市.*(风险)?.*警示|退市风险'),
                    ],
            'del_title':[re.compile('撤销(退市|(风险)?.*警示)')],
            'abstract':[],            
            },
        
        '停复牌':{
            'type':[re.compile('(暂停|延期恢复)转让'),
                    re.compile('延期复牌'),
                    re.compile('停牌'),
                    ],
            'title':[re.compile('(暂停|延期恢复)转让'),
                     re.compile('延期复牌'),
                     re.compile('停牌'),
                    ],
            'abstract':[],
            },
                
        '关联交易':{
            'type':[re.compile('关联交易'),
                    ],
            'title':[re.compile('(?!日常).*关联交易'),
                    ],
            'abstract':[],
            'del_title':[],
            },
                
        '业绩对赌':{
            'type':[re.compile('对赌'),
                    ],
            'title':[re.compile('(签订|签署|履行)(?!(取消|终止))对赌'),
                     re.compile('实际控制人.*(?!终止).*对赌情况'),
                    ],
            'abstract':[],
            },
                
        '股价异动':{
            'type':[re.compile('股.*价.*(异常|波动)|异动|股票.*异常波动'),
                    ],
            'title':[re.compile('股.*价.*(异常|波动)|异动|股票.*异常波动'),
                    ],
            'del_title':[re.compile('未发生|未出现')],
            'abstract':[], 
            }, 
                
        '违约欠款':{
            'type':[re.compile('拖欠'),
                    re.compile('违反.*义务'),
                    re.compile('催收'),
                    ],
            'title':[re.compile('拖欠.*(工资|社保|合同价款)'),
                     re.compile('违反.*义务'),
                     re.compile('催收'),
                    ],
            'abstract':[],
            }, 
                
        '意外事故':{
            'type':[re.compile('事故|意外'),
                    ],
            'title':[re.compile('事故|意外'),
                    ],
            'abstract':[],
        }, 
                
        '会计政策变更':{
            'type':[re.compile('会计(政策|估计).*变更|变更.*会计(政策|估计)'),
                    ],
            'title':[re.compile('会计(政策|估计).*变更|变更.*会计(政策|估计)'),
                    ],
            'abstract':[],
        }, 
                
        '财报缺失':{
            'type':[re.compile('(拟)?不(能)?披露|无法披露')
                    ],
            'title':[re.compile('((拟)?不(能)?|无法)披露.*(报告|年报|半年报|季报)|(报告|年报|半年报|季报).*((拟)?不(能)?|无法)披露')
                    ],
            'abstract':[],
            },
            
        '异常交易':{
            'type':[re.compile('异常波动'),
                    re.compile('异常转让'),
                    ],
            'title':[re.compile('股份交易异常波动'),
                     re.compile('证券异常转让'),
                     re.compile('操纵')
                    ],
            'abstract':[],
            },
        }
  